app/controllers/musics_controller.rb

SELECT "musics".* FROM "musics"
---
  def index
    @musics = Music.all

INSERT INTO "musics" ("artist", "title", "album", "created_at", "updated_at", "is_favorite") VALUES (?, ?, ?, ?, ?, ?)  [["artist", "Britney Spears"], ["title", "I'm Slave 4 You"], ["album", "Britney"], ["created_at", 2016-07-15 16:05:45 UTC], ["updated_at", 2016-07-15 16:05:45 UTC], ["is_favorite", false]]
---
  def create
    @music = Music.new(music_params)

    respond_to do |format|
      if @music.save

UPDATE "musics" SET "cover_file_name" = ?, "cover_file_size" = ?, "cover_updated_at" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["cover_file_name", "Rihanna_-_Anti.png"], ["cover_file_size", 122200], ["cover_updated_at", 2016-07-19 21:06:27 UTC], ["updated_at", 2016-07-19 21:06:27 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @music.update(music_params)

DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 980190962]]
---
  def destroy
    @music.destroy

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_music
      @music = Music.find(params[:id])